#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
module.repository_tf["onboarding"].data.github_team.owner: Reading...
module.repository_svc_template["rust"].data.github_team.owner: Reading...
module.repository_lib_template["rust"].data.github_team.owner: Reading...
module.repository_svc_template["rust"].github_repository.repository: Refreshing state... [id=svc-template-rust]
module.repository["clabot-config"].github_repository.repository: Refreshing state... [id=clabot-config]
module.repository["cla-bot"].data.github_team.owner: Reading...
module.repository_rust_svc["storage"].data.github_team.owner: Reading...
module.repository_rust_lib["router"].data.github_team.owner: Reading...
module.repository_lib_template["rust"].github_repository.repository: Refreshing state... [id=lib-template-rust]
module.repository_tf["onboarding"].github_repository.repository: Refreshing state... [id=tf-onboarding]
module.repository_svc_template["typescript"].github_repository.repository: Refreshing state... [id=svc-template-typescript]
module.repository_svc_template["python"].github_repository.repository: Refreshing state... [id=svc-template-python]
module.repository["tools"].github_repository.repository: Refreshing state... [id=tools]
module.repository["website"].github_repository.repository: Refreshing state... [id=website]
module.repository["benchmarks"].github_repository.repository: Refreshing state... [id=benchmarks]
module.repository["cla-bot"].github_repository.repository: Refreshing state... [id=cla-bot]
module.repository_tf["github"].data.github_team.owner: Reading...
module.repository_tf["github"].github_repository.repository: Refreshing state... [id=tf-github]
module.repository_rust_svc["scheduler"].data.github_team.owner: Reading...
module.repository_svc_template["rust"].data.github_team.owner: Read complete after 4s [id=6311795]
module.repository["clabot-config"].data.github_team.owner: Reading...
module.repository_tf["onboarding"].data.github_team.owner: Read complete after 4s [id=6029505]
module.repository["tools"].data.github_team.owner: Reading...
module.repository_lib_template["rust"].data.github_team.owner: Read complete after 5s [id=6311795]
module.repository["website"].data.github_team.owner: Reading...
module.repository["benchmarks"].data.github_team.owner: Reading...
module.repository_rust_svc["storage"].data.github_team.owner: Read complete after 5s [id=6311795]
module.repository_svc_template["typescript"].data.github_team.owner: Reading...
module.repository["cla-bot"].data.github_team.owner: Read complete after 5s [id=6029505]
module.repository_svc_template["python"].data.github_team.owner: Reading...
module.repository_rust_lib["router"].data.github_team.owner: Read complete after 6s [id=6311795]
module.repository_lib_template["rust"].github_branch.branch["develop"]: Refreshing state... [id=lib-template-rust:develop]
module.repository_lib_template["rust"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104862]
module.repository_svc_template["typescript"].github_branch.branch["develop"]: Refreshing state... [id=svc-template-typescript:develop]
module.repository_svc_template["python"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104833]
module.repository["tools"].data.github_team.owner: Read complete after 4s [id=6203057]
module.repository_svc_template["python"].github_branch.branch["develop"]: Refreshing state... [id=svc-template-python:develop]
module.repository_svc_template["rust"].github_branch.branch["develop"]: Refreshing state... [id=svc-template-rust:develop]
module.repository_tf["github"].data.github_team.owner: Read complete after 6s [id=6029505]
module.repository_svc_template["rust"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104840]
module.repository_svc_template["typescript"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104835]
module.repository_rust_svc["scheduler"].data.github_team.owner: Read complete after 7s [id=6311795]
module.repository_lib_template["rust"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:lib-template-rust]
module.repository["clabot-config"].data.github_team.owner: Read complete after 6s [id=6029505]
module.repository["website"].github_branch.branch["staging"]: Refreshing state... [id=website:staging]
module.repository_tf["onboarding"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087608]
module.repository["website"].data.github_team.owner: Read complete after 6s [id=5490296]
module.repository_tf["github"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087606]
module.repository["benchmarks"].data.github_team.owner: Read complete after 6s [id=6311795]
module.repository_lib_template["rust"].github_branch_default.default: Refreshing state... [id=lib-template-rust]
module.repository_svc_template["typescript"].data.github_team.owner: Read complete after 6s [id=6311795]
module.repository_rust_lib["router"].github_repository.repository: Refreshing state... [id=lib-router]
module.repository_svc_template["python"].data.github_team.owner: Read complete after 7s [id=6311795]
module.repository_tf["onboarding"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-onboarding]
module.repository_tf["onboarding"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-onboarding]
module.repository_tf["github"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-github]
module.repository_tf["github"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-github]
module.repository_rust_svc["scheduler"].github_repository.repository: Refreshing state... [id=svc-scheduler]
module.repository_rust_svc["storage"].github_repository.repository: Refreshing state... [id=svc-storage]
module.repository_tf["onboarding"].github_branch_default.default: Refreshing state... [id=tf-onboarding]
module.repository_tf["github"].github_branch_default.default: Refreshing state... [id=tf-github]
module.repository["benchmarks"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:benchmarks]
module.repository["cla-bot"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:cla-bot]
module.repository["clabot-config"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:clabot-config]
module.repository["tools"].github_team_repository.maintainer["drone-engineering"]: Refreshing state... [id=6203057:tools]
module.repository["website"].github_team_repository.maintainer["webdevelopers"]: Refreshing state... [id=5490296:website]
module.repository_svc_template["typescript"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-typescript]
module.repository_svc_template["python"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-python]
module.repository_svc_template["rust"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-rust]
module.repository_svc_template["typescript"].github_branch_default.default: Refreshing state... [id=svc-template-typescript]
module.repository_svc_template["python"].github_branch_default.default: Refreshing state... [id=svc-template-python]
module.repository_svc_template["rust"].github_branch_default.default: Refreshing state... [id=svc-template-rust]
module.repository["website"].github_branch_default.default: Refreshing state... [id=website]
module.repository["benchmarks"].github_branch_default.default: Refreshing state... [id=benchmarks]
module.repository["cla-bot"].github_branch_default.default: Refreshing state... [id=cla-bot]
module.repository["clabot-config"].github_branch_default.default: Refreshing state... [id=clabot-config]
module.repository["tools"].github_branch_default.default: Refreshing state... [id=tools]
module.repository_lib_template["rust"].github_repository_file.CODEOWNERS: Refreshing state... [id=lib-template-rust/.github/CODEOWNERS]
module.repository_rust_lib["router"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:lib-router]
module.repository_rust_lib["router"].github_branch.branch["develop"]: Refreshing state... [id=lib-router:develop]
module.repository_rust_lib["router"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953444]
module.repository_rust_svc["scheduler"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-scheduler]
module.repository_rust_svc["storage"].github_branch.branch["develop"]: Refreshing state... [id=svc-storage:develop]
module.repository_rust_svc["storage"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953439]
module.repository_rust_svc["storage"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-storage]
module.repository_rust_svc["scheduler"].github_branch.branch["develop"]: Refreshing state... [id=svc-scheduler:develop]
module.repository_rust_svc["scheduler"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953430]
module.repository_tf["onboarding"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-onboarding/.github/CODEOWNERS]
module.repository_tf["github"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-github/.github/CODEOWNERS]
module.repository_svc_template["typescript"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-template-typescript/.github/CODEOWNERS]
module.repository_svc_template["python"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-template-python/.github/CODEOWNERS]
module.repository_svc_template["rust"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-template-rust/.github/CODEOWNERS]
module.repository["clabot-config"].github_repository_file.CODEOWNERS: Refreshing state... [id=clabot-config/.github/CODEOWNERS]
module.repository["tools"].github_repository_file.CODEOWNERS: Refreshing state... [id=tools/.github/CODEOWNERS]
module.repository["website"].github_repository_file.CODEOWNERS: Refreshing state... [id=website/.github/CODEOWNERS]
module.repository["benchmarks"].github_repository_file.CODEOWNERS: Refreshing state... [id=benchmarks/.github/CODEOWNERS]
module.repository["cla-bot"].github_repository_file.CODEOWNERS: Refreshing state... [id=cla-bot/.github/CODEOWNERS]
module.repository_rust_lib["router"].github_branch_default.default: Refreshing state... [id=lib-router]
module.repository_rust_svc["storage"].github_branch_default.default: Refreshing state... [id=svc-storage]
module.repository_rust_svc["scheduler"].github_branch_default.default: Refreshing state... [id=svc-scheduler]
module.repository_lib_template["rust"].github_branch_protection.all["lib-template-rust"]: Refreshing state... [id=BPR_kwDOHwJLh84BqmYC]
module.repository_lib_template["rust"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHwJLh84BqmYF]
module.repository_lib_template["rust"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHwJLh84BqmYD]
module.repository_tf["github"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOG6VIns4BpLGe]
module.repository_tf["github"].github_branch_protection.all["tf-github"]: Refreshing state... [id=BPR_kwDOG6VIns4BpnEQ]
module.repository_svc_template["typescript"].github_branch_protection.all["svc-template-typescript"]: Refreshing state... [id=BPR_kwDOHtu-d84BqmXw]
module.repository_svc_template["typescript"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHtu-d84BqmXu]
module.repository_svc_template["typescript"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHtu-d84BqmXx]
module.repository_svc_template["python"].github_branch_protection.all["svc-template-python"]: Refreshing state... [id=BPR_kwDOHrbxrc4BqmXq]
module.repository_svc_template["rust"].github_branch_protection.all["svc-template-rust"]: Refreshing state... [id=BPR_kwDOHn-JXc4BqmXy]
module.repository_svc_template["python"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHrbxrc4BqmXs]
module.repository_svc_template["python"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHrbxrc4BqmXr]
module.repository_svc_template["rust"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHn-JXc4BqmXz]
module.repository_svc_template["rust"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-JXc4Bqprl]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=lib-router/.github/workflows/python_ci.yml]
module.repository_rust_lib["router"].github_repository_file.CODEOWNERS: Refreshing state... [id=lib-router/.github/CODEOWNERS]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/pre-commit]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=lib-router/.github/workflows/editorconfig_check.yml]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/pre-push]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=lib-router/.github/workflows/rust_ci.yml]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/README.md]
module.repository_rust_lib["router"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=lib-router/.editorconfig]
module.repository_rust_lib["router"].github_repository_file.files[".gitignore"]: Refreshing state... [id=lib-router/.gitignore]
module.repository_rust_lib["router"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=lib-router/.cargo/config.toml]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=svc-storage/.cargo/config.toml]
module.repository_rust_svc["scheduler"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-scheduler/.github/CODEOWNERS]
module.repository_rust_svc["storage"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=svc-storage/.editorconfig]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/README.md]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=svc-storage/.github/workflows/python_ci.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".gitignore"]: Refreshing state... [id=svc-storage/.gitignore]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=svc-storage/.github/workflows/editorconfig_check.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=svc-storage/.github/workflows/rust_ci.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/pre-commit]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/pre-push]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/pre-push]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/README.md]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/pre-commit]
module.repository_rust_svc["scheduler"].github_repository_file.files[".gitignore"]: Refreshing state... [id=svc-scheduler/.gitignore]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/editorconfig_check.yml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=svc-scheduler/.cargo/config.toml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=svc-scheduler/.editorconfig]
module.repository_rust_svc["storage"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-storage/.github/CODEOWNERS]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/rust_ci.yml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/python_ci.yml]
module.repository["tools"].github_branch_protection.all["tools"]: Refreshing state... [id=BPR_kwDOHn-Jf84BpnEA]
module.repository["website"].github_branch_protection.all["website"]: Refreshing state... [id=BPR_kwDOGdyvzM4BpnEJ]
module.repository["benchmarks"].github_branch_protection.all["benchmarks"]: Refreshing state... [id=BPR_kwDOHzRWt84Bqv9P]
module.repository["cla-bot"].github_branch_protection.all["cla-bot"]: Refreshing state... [id=BPR_kwDOHTAbhc4BpnEE]
module.repository["tools"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Jf84BmmRe]
module.repository["website"].github_branch_protection.protection["staging"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcL]
module.repository["benchmarks"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHzRWt84Bqv9O]
module.repository["website"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcN]
module.repository["cla-bot"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHTAbhc4BmmRb]
module.repository_rust_lib["router"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9o84Bqid1]
module.repository_rust_lib["router"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9o84Bqidv]
module.repository_rust_lib["router"].github_branch_protection.all["lib-router"]: Refreshing state... [id=BPR_kwDOHyi9o84BqieE]
module.repository_rust_svc["storage"].github_branch_protection.all["svc-storage"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieI]
module.repository_rust_svc["storage"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieF]
module.repository_rust_svc["storage"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieG]
module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidr]
module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidt]
module.repository_rust_svc["scheduler"].github_branch_protection.all["svc-scheduler"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidq]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"0f59c4f8deb03c22ed6a971a18617bf0388fa4f39017ffde88e5ada4dd9d6402\"" -> "W/\"8ffb67811218fdd679210edef87e484d27248281b9bf58910ca08136e8a88759\""
        id            = "website:staging"
        # (5 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"5006cce55ce31b4dd83ae831ba83b5249e38606634b270e7b7efb75fcf689b12\"" -> "W/\"93ebf95c263699501a07bb36ab238da7ce0936c33c5fd4522d730a6e0445d1b8\""
        id            = "lib-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"485d34e52176e721de2d3b1671f744b146b36bb7383a33612c79611de132098b\"" -> "W/\"bc84afb59ca2a74c4ebcf1bb1e2317f8ce0859097f0187dc7e47132581080f1a\""
        id            = "lib-router:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"a5a08233543ede7112a98d02e39629a2e3a864af2248f5671fecdfec1ce31fae\"" -> "W/\"08012b1233e8168e5a47df3973baea9dc8ce05acf512b777ecb343259fdda5ad\""
        id            = "svc-scheduler:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"fe7378f8a076504d10581cb77aabc7bff1e4641913da1a5c2a36584a12818fac\"" -> "W/\"73cc405a1bda37b2a50bdb38816f105f2a93e949b1364ffd95899289d8284fb5\""
        id            = "svc-storage:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"e1c3d73d1817126e17515ae8a5621053e4980944e5352e1fbba0f7bdea7de53a\"" -> "W/\"b52d6d7a482a81674014572d4f00a7b8866be8f3f11cc17e13cffdb35ab1b006\""
        id            = "svc-template-python:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"8089a699820753e28e497878f95fd16c8efc9123804929e2a326580ba95daa12\"" -> "W/\"92e1f80d1f35c3f8cd11d5802d2f5002fd2311b512cff3946ba75fe2a05d451a\""
        id            = "svc-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"65c6c197efc3c7a25baa378cb082b0f2a59c41d60dfc02b18906ea1674f35f8d\"" -> "W/\"6bedcad432355c8dbcbc65be2943ff68686b293f4e125a42ea69b7046dd44adb\""
        id            = "svc-template-typescript:develop"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["benchmarks"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHzRWt84Bqv9O"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["benchmarks"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["benchmarks"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            BOLD=$(tput bold)
            NC=$'\e[0m'
            
            echo "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${NC}\n" # should be visible in the console when doing a git commit
            
            set -e
            
            # RUST
            echo "${YELLOW}Running cargo tests...${NC}"
            cargo test --all
            echo "${YELLOW}Linting Rust codes through clippy...${NC}"
            cargo clippy --all -- -D warnings
            echo "${YELLOW}Running and checking Rust codes formats...\n${NC}"
            cargo fmt --all -- --check
            
            # PYTHON 3
            echo "${YELLOW}Formatting and checking Python files with Google style...\n${NC}"
            yapf -r -i -vv . style google
            echo "${YELLOW}Formatting and checking Python files with flake8 style...\n${NC}"
            flake8 .
            
            
            # Style Check
            echo "${YELLOW}Checking if the codebase is compliant with the .editorconfig file...\n${NC}"
            ec
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!\n${NC}${NC}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["benchmarks"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["benchmarks"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
                "-Wmissing_docs",
                "-Wmissing_debug_implementations",
                "-Wmissing_copy_implementations",
                "-Wtrivial_casts",
                "-Wtrivial_numeric_casts",
                "-Wunsafe_code",
                "-Wunstable_features",
                "-Wunused_import_braces",
                "-Wunused_qualifications"
                ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["benchmarks"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.yml]
            indent_size = 2
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["benchmarks"].github_repository_file.files[".github/workflows/editorconfig_check.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: EditorConfig Check
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: EditorConfig-Action
                  uses: editorconfig-checker/action-editorconfig-checker@main
                - run: editorconfig-checker
        EOT
      + file                = ".github/workflows/editorconfig_check.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["benchmarks"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Python Checks
            
            # env:
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: YAPF for proper formatting
                  run: |
                    python3 -m pip install -r requirements.txt
                    yapf -r -i -vv . style google
            
              flake8-lint:
                runs-on: ubuntu-20.04
                name: Lint
                steps:
                  - name: Check out source repository
                    uses: actions/checkout@v2
                  - name: Set up Python environment
                    uses: actions/setup-python@v2
                    with:
                      python-version: "3.10"
                  - name: flake8 Lint
                    uses: py-actions/flake8@v2
                    with:
                      # ignore: "F401"
                      exclude: "src/ignoreme.py"
                      max-line-length: "100"
                      path: "src"
                      plugins: "flake8-bugbear==22.1.11 flake8-black"
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["benchmarks"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Rust Checks
            
            env:
              RUST_VERSION: 1.62.0
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - uses: actions-rs/cargo@v1
                    with:
                      command: check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-20.04
                env:
                    RUSTC_BOOTSTRAP: 1
                    CARGO_INCREMENTAL: 0
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
            
                  - name: Build
                    run: cargo build
            
                  - name: Test
                    run: cargo test
            
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add rustfmt
                  - uses: actions-rs/cargo@v1
                    with:
                      command: fmt
                      args: --all -- --check
            
              clippy:
                name: Clippy
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add clippy
                  - uses: actions-rs/cargo@v1
                    with:
                      command: clippy
                      args: -- -D warnings
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "benchmarks"
      + sha                 = (known after apply)
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYD"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXs"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4BqmXz"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4Bqprl"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXu"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXx"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_tf["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 20 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = {
      ~ website       = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"0f59c4f8deb03c22ed6a971a18617bf0388fa4f39017ffde88e5ada4dd9d6402\"" -> "W/\"8ffb67811218fdd679210edef87e484d27248281b9bf58910ca08136e8a88759\""
                    id            = "website:staging"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (4 unchanged elements hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @owlot, Action: `pull_request`*